src/CF/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/КурсыВалют/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//sza140428-2144 SZA: 
//sza131007-1634  

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                          // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                               // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350");	
	
	Если НЕ ОТказ 
		И ЕстьЗависимыеЦены(Запись.Валюта) 
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Есть Зависимые цены!") + символы.пс + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Рассчитать все зависимые цены по этому курсу валют (если он изменился)?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расчет всех зависимых цен.."));
		РассчитатьВсеЗависимыеЦены();
		
	КонецЕсли;
	
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
	
КонецПроцедуры

&НаСервере
Функция   ЕстьЗависимыеЦены(Знач Валюта) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Цены.Цена
		|ИЗ РегистрСведений.Цены КАК Цены
		|ГДЕ Цены.Цена <> 0
		|	И Цены.ВидЦен.Зависимая = Истина
		|	И Цены.ВидЦен.ОсновнойВидЦен.ВалютаЦены = &ВалютаЦены";

	Запрос.УстановитьПараметр("ВалютаЦены", Валюта);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Если ЗначениеЗаполнено(Параметры.Валюта) Тогда
		Запись.Валюта = Параметры.Валюта;
	КонецЕсли;
	
	НаименованиеБазововйВалюты = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование ;
	ВыяснитьТекущийКурс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВыяснитьТекущийКурс();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВыяснитьТекущийКурс();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ВыяснитьТекущийКурс()
	
	элементы.На1Валюту.Заголовок = сокрлп(НаименованиеБазововйВалюты) + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на") + " 1 " + запись.Валюта;
	
	Если ЗначениеЗаполнено(Запись.Валюта) Тогда
		Если Запись.Валюта.Предопределенный Тогда
			ТекущийКурс = 1;
			Запись.Курс = 1;
			элементы.Курс.Доступность = ложь;
		Иначе
			ТекущийКурс = ОбщийМодульПовтор.ПолучитьТекущийКурс(Запись.Валюта);
			Элементы.Курс.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		Элементы.ТекущийКурс.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Курс на") + " " + Формат(ОбщийМодульСервисСервер.ПользователяТекущаяДата(), "ДФ=dd.MM.yyyy") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" от") + " " + Справочники.Валюты.ОсновнаяВалюта.Наименование;
	КонецЕсли;	
	ОбратныйПересчетКурса();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	ОбратныйПересчетКурса();
КонецПроцедуры

&НаСервере
Процедура ОбратныйПересчетКурса()
	
	Если ЗначениеЗаполнено(запись.Валюта) 
		и не запись.Курс = 0 Тогда
		элементы.ОбратныйПересчет.Заголовок = "1 " + НаименованиеБазововйВалюты + " = " + формат(1 / запись.Курс, "ЧЦ=10; ЧДЦ=4") + " " + запись.Валюта;
	иначе
		элементы.ОбратныйПересчет.Заголовок = "";
	КонецЕсли;  	
	
КонецПроцедуры 

&НаКлиенте
Процедура НаНачалоМесяца(Команда)
	запись.Период = НачалоМесяца(ОбщийМодульКлиент.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьВсеЗависимыеЦены(Команда)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350");	
	
	Если НЕ ОТказ 
		И ЕстьЗависимыеЦены(Запись.Валюта) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Есть Зависимые цены!") + символы.пс + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Рассчитать все зависимые цены по этой валюте?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расчет всех зависимых цен.."));
		РассчитатьВсеЗависимыеЦены();
		
	КонецЕсли;
	
	глПроверятьСообщения = Истина;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьВсеЗависимыеЦены()	
	ОбщийМодульСервер.РассчитатьВсеЗависимыеЦеныПриСменеКурса(Запись.Валюта);	
КонецПроцедуры
